zhantss/ESP32-BLE5-NSController-Emulator/sdkconfig.defaults.esp32s3
# Test on ESP32-C61-DevKitC-1-N8R2

CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# 70 -> 257(max)
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=257
CONFIG_BT_NIMBLE_EXT_ADV=y

# use usb cdc for transport layer
CONFIG_TRANSPORT_LAYER_USB_CDC=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# S3
CONFIG_HID_REPORT_INTERVAL=15

# FLASH
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_n2c.csv"

# Memory
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=150
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=128
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=30
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=512

# OTHER
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=255
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=n
